using NumberToWords.Converter;

namespace NumberToWords.Language;

/// <summary>
/// Converts numbers to Nepali words.
/// </summary>
public class NepaliNumberWords : INumberLanguage
{
    private readonly Dictionary<int, string> _numbers = new()
    {
        {0, "शून्य"}, {1, "एक"}, {2, "दुई"}, {3, "तीन"}, {4, "चार"},
        {5, "पाँच"}, {6, "छ"}, {7, "सात"}, {8, "आठ"}, {9, "नौ"},
        {10, "दश"}, {11, "एघार"}, {12, "बाह्र"}, {13, "तेह्र"}, {14, "चौध"},
        {15, "पन्ध्र"}, {16, "सोह्र"}, {17, "सत्र"}, {18, "अठार"}, {19, "उन्नाइस"},
        {20, "बीस"}, {21, "एक्काइस"}, {22, "बाइस"}, {23, "तेइस"}, {24, "चौबिस"},
        {25, "पच्चिस"}, {26, "छब्बिस"}, {27, "सत्ताइस"}, {28, "अट्ठाइस"}, {29, "उनन्तिस"},
        {30, "तीस"}, {31, "एकत्तिस"}, {32, "बत्तिस"}, {33, "तेत्तिस"}, {34, "चौंतीस"},
        {35, "पैंतीस"}, {36, "छत्तिस"}, {37, "सैंतीस"}, {38, "अठतीस"}, {39, "उनन्चालीस"},
        {40, "चालीस"}, {41, "एकचालीस"}, {42, "बयालीस"}, {43, "त्रियालीस"}, {44, "चवालीस"},
        {45, "पैंतालीस"}, {46, "छयालीस"}, {47, "सतचालीस"}, {48, "अठचालीस"}, {49, "उनन्चास"},
        {50, "पचास"}, {51, "एकाउन्न"}, {52, "बाउन्न"}, {53, "त्रिपन्न"}, {54, "चउन्न"},
        {55, "पचपन्न"}, {56, "छपन्न"}, {57, "सन्ताउन्न"}, {58, "अन्ठाउन्न"}, {59, "उनन्साठी"},
        {60, "साठी"}, {61, "एकसठ्ठी"}, {62, "बासठ्ठी"}, {63, "त्रिसठ्ठी"}, {64, "चौंसठ्ठी"},
        {65, "पैंसठ्ठी"}, {66, "छैसठ्ठी"}, {67, "सड्सठ्ठी"}, {68, "अठ्सठ्ठी"}, {69, "उनन्सत्तरी"},
        {70, "सत्तरी"}, {71, "एकहत्तर"}, {72, "बहत्तर"}, {73, "त्रिहत्तर"}, {74, "चौरहत्तर"},
        {75, "पचहत्तर"}, {76, "छयहत्तर"}, {77, "सतहत्तर"}, {78, "अठहत्तर"}, {79, "उनासी"},
        {80, "असी"}, {81, "एकासी"}, {82, "बयासी"}, {83, "त्रियासी"}, {84, "चौरासी"},
        {85, "पचासी"}, {86, "छयासी"}, {87, "सतासी"}, {88, "अठासी"}, {89, "उनान्नब्बे"},
        {90, "नब्बे"}, {91, "एकान्नब्बे"}, {92, "बयान्नब्बे"}, {93, "त्रियान्नब्बे"}, {94, "चौरान्नब्बे"},
        {95, "पन्चान्नब्बे"}, {96, "छयान्नब्बे"}, {97, "सन्तान्नब्बे"}, {98, "अन्ठान्नब्बे"}, {99, "उनान्सय"}
    };

    private readonly (long, string)[] _units = new (long, string)[]
    {
        (1000000000000, "खरब"),
        (10000000000, "अरब"),
        (10000000, "करोड"),
        (100000, "लाख"),
        (1000, "हजार"),
        (100, "सय")
    };

    private const string NegativePrefix = "ऋणात्मक";

    public string ConvertInteger(long number)
    {
        return DirectConverter.ConvertInteger(number, _numbers, _units, NegativePrefix);
    }

    public string ConvertFractional(int number)
    {
        return DirectConverter.ConvertFractional(number, _numbers, _units, NegativePrefix);
    }

    public string AddCurrency(string text)
    {
        if (text.EndsWith("रुपैया") || text.EndsWith("पैसा"))
            return text;

        return $"{text} रुपैया";
    }

    public string GetDecimalConnector() => "डशमलव";
    public string GetFractionalCurrency() => "पैसा";
    public string GetNegativePrefix() => NegativePrefix;
}