using NumberToWords.Converter;

namespace NumberToWords.Language;

/// <summary>
/// Converts numbers to Thai words.
/// </summary>
public class ThaiNumberWords : INumberLanguage
{
    private readonly Dictionary<int, string> _numbers = new()
    {
        {0, "ศูนย์"}, {1, "หนึ่ง"}, {2, "สอง"}, {3, "สาม"}, {4, "สี่"},
        {5, "ห้า"}, {6, "หก"}, {7, "เจ็ด"}, {8, "แปด"}, {9, "เก้า"},
        {10, "สิบ"}, {11, "สิบเอ็ด"}, {12, "สิบสอง"}, {13, "สิบสาม"}, {14, "สิบสี่"},
        {15, "สิบห้า"}, {16, "สิบหก"}, {17, "สิบเจ็ด"}, {18, "สิบแปด"}, {19, "สิบเก้า"},
        {20, "ยี่สิบ"}, {21, "ยี่สิบเอ็ด"}, {22, "ยี่สิบสอง"}, {23, "ยี่สิบสาม"}, {24, "ยี่สิบสี่"},
        {25, "ยี่สิบห้า"}, {26, "ยี่สิบหก"}, {27, "ยี่สิบเจ็ด"}, {28, "ยี่สิบแปด"}, {29, "ยี่สิบเก้า"},
        {30, "สามสิบ"}, {31, "สามสิบเอ็ด"}, {32, "สามสิบสอง"}, {33, "สามสิบสาม"}, {34, "สามสิบสี่"},
        {35, "สามสิบห้า"}, {36, "สามสิบหก"}, {37, "สามสิบเจ็ด"}, {38, "สามสิบแปด"}, {39, "สามสิบเก้า"},
        {40, "สี่สิบ"}, {41, "สี่สิบเอ็ด"}, {42, "สี่สิบสอง"}, {43, "สี่สิบสาม"}, {44, "สี่สิบสี่"},
        {45, "สี่สิบห้า"}, {46, "สี่สิบหก"}, {47, "สี่สิบเจ็ด"}, {48, "สี่สิบแปด"}, {49, "สี่สิบเก้า"},
        {50, "ห้าสิบ"}, {51, "ห้าสิบเอ็ด"}, {52, "ห้าสิบสอง"}, {53, "ห้าสิบสาม"}, {54, "ห้าสิบสี่"},
        {55, "ห้าสิบห้า"}, {56, "ห้าสิบหก"}, {57, "ห้าสิบเจ็ด"}, {58, "ห้าสิบแปด"}, {59, "ห้าสิบเก้า"},
        {60, "หกสิบ"}, {61, "หกสิบเอ็ด"}, {62, "หกสิบสอง"}, {63, "หกสิบสาม"}, {64, "หกสิบสี่"},
        {65, "หกสิบห้า"}, {66, "หกสิบหก"}, {67, "หกสิบเจ็ด"}, {68, "หกสิบแปด"}, {69, "หกสิบเก้า"},
        {70, "เจ็ดสิบ"}, {71, "เจ็ดสิบเอ็ด"}, {72, "เจ็ดสิบสอง"}, {73, "เจ็ดสิบสาม"}, {74, "เจ็ดสิบสี่"},
        {75, "เจ็ดสิบห้า"}, {76, "เจ็ดสิบหก"}, {77, "เจ็ดสิบเจ็ด"}, {78, "เจ็ดสิบแปด"}, {79, "เจ็ดสิบเก้า"},
        {80, "แปดสิบ"}, {81, "แปดสิบเอ็ด"}, {82, "แปดสิบสอง"}, {83, "แปดสิบสาม"}, {84, "แปดสิบสี่"},
        {85, "แปดสิบห้า"}, {86, "แปดสิบหก"}, {87, "แปดสิบเจ็ด"}, {88, "แปดสิบแปด"}, {89, "แปดสิบเก้า"},
        {90, "เก้าสิบ"}, {91, "เก้าสิบเอ็ด"}, {92, "เก้าสิบสอง"}, {93, "เก้าสิบสาม"}, {94, "เก้าสิบสี่"},
        {95, "เก้าสิบห้า"}, {96, "เก้าสิบหก"}, {97, "เก้าสิบเจ็ด"}, {98, "เก้าสิบแปด"}, {99, "เก้าสิบเก้า"}
    };

    private readonly (long, string)[] _units = new (long, string)[]
    {
        (1000000, "ล้าน"),
        (100000, "แสน"),
        (10000, "หมื่น"),
        (1000, "พัน"),
        (100, "ร้อย")
    };

    private const string NegativePrefix = "ลบ";

    public string ConvertInteger(long number)
    {
        return DirectConverter.ConvertInteger(number, _numbers, _units, NegativePrefix, true);
    }

    public string ConvertFractional(int number)
    {
        return DirectConverter.ConvertFractional(number, _numbers, _units, NegativePrefix, true);
    }

    public string AddCurrency(string text)
    {
        if (text.EndsWith("บาท") || text.EndsWith("สตางค์"))
            return text;

        return $"{text} บาท";
    }

    public string GetDecimalConnector() => "จุด";
    public string GetFractionalCurrency() => "สตางค์";
    public string GetNegativePrefix() => NegativePrefix;
}